; ModuleID = '/mnt/c/data/work_thu/code_thu/hpcc/test/TC231206B/input.cpp.4.tmp.cpp'
source_filename = "/mnt/c/data/work_thu/code_thu/hpcc/test/TC231206B/input.cpp.4.tmp.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%class.Simdcore_param_type = type { i8 }
%class.Pack_param_type = type { i8 }
%class.InitInstr = type { i8 }
%class.LoadInstr = type { i8 }
%class.StoreInstr = type { i8 }
%class.GemmInstr = type { i8 }
%class.VectorInstr = type { i8 }

@Simdcore_param = dso_local global %class.Simdcore_param_type zeroinitializer, align 1, !dbg !0
@Pack_param = dso_local global %class.Pack_param_type zeroinitializer, align 1, !dbg !5
@.str.1 = private unnamed_addr constant [5 x i8] c"simd\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"acti\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"double\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"wgt\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"bias\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c"acto\00", align 1
@.str.7 = private unnamed_addr constant [8 x i8] c"uniform\00", align 1
@.str.8 = private unnamed_addr constant [10 x i8] c"load_func\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c"load\00", align 1
@.str.10 = private unnamed_addr constant [10 x i8] c"gemm_func\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Simdcore_param", scope: !2, file: !7, line: 14, type: !273, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, imports: !27, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/mnt/c/data/work_thu/code_thu/hpcc/test/TC231206B/input.cpp.4.tmp.cpp", directory: "/mnt/c/data/work_thu/code_thu/hpcc/test/TC231206B", checksumkind: CSK_MD5, checksum: "e43c0b0925844bfebb78bae34d252f5d")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "Pack_param", scope: !2, file: !7, line: 24, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "input.cpp.4.tmp.cpp", directory: "/mnt/c/data/work_thu/code_thu/hpcc/test/TC231206B", checksumkind: CSK_MD5, checksum: "e43c0b0925844bfebb78bae34d252f5d")
!8 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Pack_param_type", file: !7, line: 16, size: 8, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS15Pack_param_type")
!9 = !{!10, !18, !21}
!10 = !DISubprogram(name: "settensor", linkageName: "_ZN15Pack_param_type9settensorEPKc", scope: !8, file: !7, line: 19, type: !11, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !15}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DISubprogram(name: "conv", linkageName: "_ZN15Pack_param_type4convEiiii", scope: !8, file: !7, line: 20, type: !19, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!19 = !DISubroutineType(types: !20)
!20 = !{!13, !14, !13, !13, !13, !13}
!21 = !DISubprogram(name: "vector", linkageName: "_ZN15Pack_param_type6vectorEPKcPd", scope: !8, file: !7, line: 21, type: !22, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !14, !15, !25}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!27 = !{!28, !91, !97, !102, !106, !108, !110, !112, !114, !121, !126, !131, !135, !139, !143, !148, !152, !154, !158, !164, !168, !175, !177, !182, !186, !190, !192, !196, !200, !202, !206, !208, !210, !214, !218, !222, !226, !230, !234, !236, !243, !247, !251, !256, !258, !260, !264, !268, !269, !270, !271, !272}
!28 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !30, file: !90, line: 98)
!29 = !DINamespace(name: "std", scope: null)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 7, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !33, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !34, identifier: "_ZTS8_IO_FILE")
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "f3c970561f3408448ce03a9676ead8f4")
!34 = !{!35, !36, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !51, !53, !54, !55, !59, !61, !63, !67, !70, !72, !75, !78, !79, !81, !85, !86}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !33, line: 51, baseType: !13, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !32, file: !33, line: 54, baseType: !37, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !32, file: !33, line: 55, baseType: !37, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !32, file: !33, line: 56, baseType: !37, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !32, file: !33, line: 57, baseType: !37, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !32, file: !33, line: 58, baseType: !37, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !32, file: !33, line: 59, baseType: !37, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !32, file: !33, line: 60, baseType: !37, size: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !32, file: !33, line: 61, baseType: !37, size: 64, offset: 512)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !32, file: !33, line: 64, baseType: !37, size: 64, offset: 576)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !32, file: !33, line: 65, baseType: !37, size: 64, offset: 640)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !32, file: !33, line: 66, baseType: !37, size: 64, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !32, file: !33, line: 68, baseType: !49, size: 64, offset: 768)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !33, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !32, file: !33, line: 70, baseType: !52, size: 64, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !32, file: !33, line: 72, baseType: !13, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !33, line: 73, baseType: !13, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !32, file: !33, line: 74, baseType: !56, size: 64, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !57, line: 152, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "f6304b1a6dcfc6bee76e9a51043b5090")
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !32, file: !33, line: 77, baseType: !60, size: 16, offset: 1024)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !32, file: !33, line: 78, baseType: !62, size: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !32, file: !33, line: 79, baseType: !64, size: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !33, line: 81, baseType: !68, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !33, line: 43, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !33, line: 89, baseType: !71, size: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !57, line: 153, baseType: !58)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !32, file: !33, line: 91, baseType: !73, size: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !33, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !32, file: !33, line: 92, baseType: !76, size: 64, offset: 1280)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !33, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !32, file: !33, line: 93, baseType: !52, size: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !32, file: !33, line: 94, baseType: !80, size: 64, offset: 1408)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !32, file: !33, line: 95, baseType: !82, size: 64, offset: 1472)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !32, file: !33, line: 96, baseType: !13, size: 32, offset: 1536)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !32, file: !33, line: 98, baseType: !87, size: 160, offset: 1568)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 20)
!90 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/9/../../../../include/c++/9/cstdio", directory: "")
!91 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !92, file: !90, line: 99)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !93, line: 84, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "5b917eded35ce2507d1e294bf8cb74d7")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fpos_t", file: !95, line: 14, baseType: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__fpos_t.h", directory: "", checksumkind: CSK_MD5, checksum: "32de8bdaf3551a6c0a9394f9af4389ce")
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_G_fpos_t", file: !95, line: 10, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS9_G_fpos_t")
!97 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !98, file: !90, line: 101)
!98 = !DISubprogram(name: "clearerr", scope: !93, file: !93, line: 757, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!102 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !103, file: !90, line: 102)
!103 = !DISubprogram(name: "fclose", scope: !93, file: !93, line: 213, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!104 = !DISubroutineType(types: !105)
!105 = !{!13, !101}
!106 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !107, file: !90, line: 103)
!107 = !DISubprogram(name: "feof", scope: !93, file: !93, line: 759, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !109, file: !90, line: 104)
!109 = !DISubprogram(name: "ferror", scope: !93, file: !93, line: 761, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !111, file: !90, line: 105)
!111 = !DISubprogram(name: "fflush", scope: !93, file: !93, line: 218, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!112 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !113, file: !90, line: 106)
!113 = !DISubprogram(name: "fgetc", scope: !93, file: !93, line: 485, type: !104, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!114 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !115, file: !90, line: 107)
!115 = !DISubprogram(name: "fgetpos", scope: !93, file: !93, line: 731, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubroutineType(types: !117)
!117 = !{!13, !118, !119}
!118 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !101)
!119 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!121 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !122, file: !90, line: 108)
!122 = !DISubprogram(name: "fgets", scope: !93, file: !93, line: 564, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!123 = !DISubroutineType(types: !124)
!124 = !{!37, !125, !13, !118}
!125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !37)
!126 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !29, entity: !127, file: !90, line: 109)
!127 = !DISubprogram(name: "fopen", scope: !93, file: !93, line: 246, type: !128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubroutineType(types: !129)
!129 = !{!101, !130, !130}
!130 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !15)
